content/posts/20211203-this-site.org
#+TITLE: Made with Org-Mode
#+DATE: <2021-12-03 Fri>

* Background
#+BEGIN_PREVIEW
I finally made a personal site using org-mode's built-in ~ox-publish~ exporter.

I've written my personal website with org-mode for years (it is, after all, [[https://karl-voit.at/2017/09/23/orgmode-as-markup-only/][one of the most
reasonable markup languages to use for text]]). But until this point, I've used Hugo (with the ~ox-Hugo~
exporter). It worked fine, but it always seemed /just a little bit too complicated/ for my needs. I
wanted to find something where I could basically understand all of the components and where the gap
between my org-mode files and the published output was as small as possible. I wanted to focus more
on the writing and less on understanding the framework.
#+END_PREVIEW

* First Steps

** Ox-Publish
[[https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site/][This great guide]] from System Crafters got me started with ~ox-publish~. The very short post
how to use ~ox-publish~ to set up a basic site; ~htmlize~ to correctly render code blocks, and
~simple-httpd~ to preview the site locally. I recommend starting here if you're interested in making
your own site with org-mode.

** GitHub Pages
[[https://systemcrafters.net/publishing-websites-with-org-mode/automated-site-publishing/][The followup post]] is just as useful—it describes the process of publishing the site with GitHub
Pages (or SourceHut; I opted for GitHub Pages). There was one minor point missing from this
article. The described GitHub action runs the site's build script and commits the ~public~ directory
to a new branch. It was, therefore, necessary to add the /local/ version of the public branch
(which we preview with ~simple-httpd~) to our ~gitignore~ file to avoid conflicts. Otherwise, this guide
was simple to follow and worked perfectly.

* Some Simple Customization
There were a few simple design and organization changes I wanted before I started writing: a simple
and readable theme; a list of recent posts with short "preview" snippets, and a link to a post
archive.

** CSS theme
I opted to use [[https://gongzhitaao.org/orgcss/][orgcss]], at least for now. It's a stylesheet explicitly designed for use with
org-exported HTML files. It looks (to me) quite a bit nicer than the default and it works well
without any additional configuration. I'm sure I'll want to make some changes in the future, but
it's a great place to start.

I applied this stylesheet to all of the exported .org files by adding the following line to my
~build-site.el~ configuration file:

#+begin_src emacs-lisp
;; org-site/build-site.el
;; ...
(setq org-html-head "<link rel=\"stylesheet\" type=\"text/css\" href=\"https://gongzhitaao.org/orgcss/org.css\"/>")
#+end_src

** Recent Posts
I wanted to include a few recent posts on the homepage and separately link to the post archive. I
also wanted each of these custom posts to have a short "preview"—a paragraph or so of my choosing
from the post. I adapted my approach to this from [[https://thibaultmarin.github.io/blog/posts/2016-11-13-Personal_website_in_org.html#sec-org-setup][this post]] (not sure of the author) and [[https://loomcom.com/blog/0110_emacs_blogging_for_fun_and_profit.html][this post]]
by Seth Morabito ([[https://twitter.com/twylo/][@twylo]]).

To include the recent posts, I included the first 25 lines of the automatically-generated
~sitemap.org~ on my index page with:

#+begin_src org
#+INCLUDE: sitemap.org::*posts :lines "-25" :only-contents t
#+end_src

