posts/20211203-this-site.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Made with Org-Mode</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/org-base.css"/>
<link rel="stylesheet" type="text/css" href="/orgstyle.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=IBM+Plex+Sans:wght@400;500;600;700&display=swap" rel="stylesheet">
<link rel="icon" href="/favicon.ico" type="image/x-icon">
<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon">
<link rel="me" href="https://emacs.ch/@dliden">
<link rel="alternate" type="application/rss+xml" title="Daniel Liden's Blog" href="/rss.xml">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="canonical" href="https://danliden.com/posts/20211203-this-site.html">
<meta name="author" content="Daniel Liden">
<meta property="og:url" content="https://danliden.com/posts/20211203-this-site.html">
<meta property="og:title" content="Made with Org-Mode">
<meta property="og:description" content="I finally made a personal site using org-mode&#39;s built-in ~ox-publish~ exporter. I&#39;ve written my personal website with org-mode for years (it is, after all, [[https://karl-voit.at/2017/09/23/orgmode...">
<meta property="og:site_name" content="Daniel Liden">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-12-03T00:00:00Z">
<meta property="article:modified_time" content="2025-10-02T14:22:16Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Made with Org-Mode">
<meta name="twitter:description" content="I finally made a personal site using org-mode&#39;s built-in ~ox-publish~ exporter. I&#39;ve written my personal website with org-mode for years (it is, after all, [[https://karl-voit.at/2017/09/23/orgmode...">
</head>
<body>
<div id="preamble" class="status">
<hr class="topnav-rule">
<header class="site-header">
  <a href="/index.html" class="site-header__brand">
    <h2>Daniel Liden</h2>
  </a>
  <nav class="topnav-links" aria-label="Primary">
    <a href="/archive.html">Blog</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/about.html">About Me</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/photos.html">Photos</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/notebooks/">Notebooks</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a href="/notes.html">Notes</a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <a class="topnav-icon" href="/rss.xml" aria-label="RSS feed">
      <svg class="rss-icon" viewBox="0 0 24 24" aria-hidden="true" fill="none" stroke="currentColor" stroke-width="1.8" stroke-linecap="round" stroke-linejoin="round">
        <path d="M5 4h1a14 14 0 0 1 14 14v1"/>
        <path d="M5 11h1a7 7 0 0 1 7 7v1"/>
        <circle cx="6" cy="18" r="2"/>
      </svg>
    </a>
    <span class="topnav-divider" aria-hidden="true">/</span>
    <button id="theme-toggle" class="nav-theme-toggle topnav-icon" type="button" aria-label="Switch to dark mode" aria-pressed="false">
      <svg class="theme-icon" viewBox="0 0 24 24" aria-hidden="true" fill="currentColor">
        <path d="M21 12.79A9 9 0 1 1 11.21 3 7 7 0 0 0 21 12.79Z"/>
      </svg>
    </button>
  </nav>
</header>
<hr class="topnav-rule">
</div>
<div id="content" class="content">
<header>
<h1 class="title">Made with Org-Mode</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6781593">Background</a></li>
<li><a href="#orgcf63f46">First Steps</a>
<ul>
<li><a href="#org6707c54">Ox-Publish</a></li>
<li><a href="#org2e1014c">GitHub Pages</a></li>
</ul>
</li>
<li><a href="#orgbf5be1f">Some Simple Customization</a>
<ul>
<li><a href="#orgcd6de91">CSS theme</a></li>
<li><a href="#orgfb6db0b">Recent Posts</a>
<ul>
<li><a href="#orgcf41199">Sitemap Configuration</a></li>
<li><a href="#org7ac9d70">Sitemap Entry Formatting</a></li>
<li><a href="#org5622541">Sitemap List Formatting</a></li>
<li><a href="#org9293afa">Previews</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0824a93">Putting It All Together</a></li>
<li><a href="#org97436e0">What's Next?</a>
<ul>
<li><a href="#orge1ba74f"><span class="done DONE">DONE</span> Add navigation buttons to return to the home page/about page/archive page/etc. from any page. (incidentally, if you want to get back home, here's the link).</a></li>
<li><a href="#org6eb3667"><span class="done DONE">DONE</span> Set up a good system for managing images (e.g. for data visualizations from R/Python)</a></li>
<li><a href="#org94d574b"><span class="todo TODO">TODO</span> Set up and test LaTeX exporting for formulas etc.</a></li>
<li><a href="#orgd878b26"><span class="todo TODO">TODO</span> Add a portfolio page showing some of my past work</a></li>
<li><a href="#org8335116"><span class="todo TODO">TODO</span> Make a more visually interesting home page</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org6781593" class="outline-2">
<h2 id="org6781593">Background</h2>
<div class="outline-text-2" id="text-org6781593">
<div class="PREVIEW" id="org8900852">
<p>
I finally made a personal site using org-mode's built-in <code>ox-publish</code> exporter.
</p>

<p>
I've written my personal website with org-mode for years (it is, after all, <a href="https://karl-voit.at/2017/09/23/orgmode-as-markup-only/">one of the most
reasonable markup languages to use for text</a>). But until this point, I've used Hugo (with the <code>ox-Hugo</code>
exporter). It worked fine, but it always seemed <i>just a little bit too complicated</i> for my needs. I
wanted to find something where I could basically understand all of the components and where the gap
between my org-mode files and the published output was as small as possible. I wanted to focus more
on the writing and less on understanding the framework.
</p>

</div>
</div>
</div>

<div id="outline-container-orgcf63f46" class="outline-2">
<h2 id="orgcf63f46">First Steps</h2>
<div class="outline-text-2" id="text-orgcf63f46">
</div>
<div id="outline-container-org6707c54" class="outline-3">
<h3 id="org6707c54">Ox-Publish</h3>
<div class="outline-text-3" id="text-org6707c54">
<p>
<a href="https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site/">This great guide</a> from System Crafters got me started with <code>ox-publish</code>. The very short post
how to use <code>ox-publish</code> to set up a basic site; <code>htmlize</code> to correctly render code blocks, and
<code>simple-httpd</code> to preview the site locally. I recommend starting here if you're interested in making
your own site with org-mode.
</p>
</div>
</div>

<div id="outline-container-org2e1014c" class="outline-3">
<h3 id="org2e1014c">GitHub Pages</h3>
<div class="outline-text-3" id="text-org2e1014c">
<p>
<a href="https://systemcrafters.net/publishing-websites-with-org-mode/automated-site-publishing/">The followup post</a> is just as useful—it describes the process of publishing the site with GitHub
Pages (or SourceHut; I opted for GitHub Pages). There was one minor point missing from this
article. The described GitHub action runs the site's build script and commits the <code>public</code> directory
to a new branch. It was, therefore, necessary to add the <i>local</i> version of the public branch
(which we preview with <code>simple-httpd</code>) to our <code>gitignore</code> file to avoid conflicts. Otherwise, this guide
was simple to follow and worked perfectly.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbf5be1f" class="outline-2">
<h2 id="orgbf5be1f">Some Simple Customization</h2>
<div class="outline-text-2" id="text-orgbf5be1f">
<p>
There were a few simple design and organization changes I wanted before I started writing: a simple
and readable theme; a list of recent posts with short "preview" snippets, and a link to a post
archive.
</p>
</div>

<div id="outline-container-orgcd6de91" class="outline-3">
<h3 id="orgcd6de91">CSS theme</h3>
<div class="outline-text-3" id="text-orgcd6de91">
<p>
I opted to use <a href="https://gongzhitaao.org/orgcss/">orgcss</a>, at least for now. It's a stylesheet explicitly designed for use with
org-exported HTML files. It looks (to me) quite a bit nicer than the default and it works well
without any additional configuration. I'm sure I'll want to make some changes in the future, but
it's a great place to start.
</p>

<p>
I applied this stylesheet to all of the exported .org files by adding the following line to my
<code>build-site.el</code> configuration file:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">org-site/build-site.el
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">...
</span>(<span class="org-keyword">setq</span> org-html-head <span class="org-string">"&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"https://gongzhitaao.org/orgcss/org.css\"/&gt;"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb6db0b" class="outline-3">
<h3 id="orgfb6db0b">Recent Posts</h3>
<div class="outline-text-3" id="text-orgfb6db0b">
<p>
I wanted to include a few recent posts on the homepage and separately link to the post archive. I
also wanted each of these custom posts to have a short "preview"—a paragraph or so of my choosing
from the post. I adapted my approach to this from <a href="https://thibaultmarin.github.io/blog/posts/2016-11-13-Personal_website_in_org.html#sec-org-setup">this post</a> (not sure of the author) and <a href="https://loomcom.com/blog/0110_emacs_blogging_for_fun_and_profit.html">this post</a>
by Seth Morabito (<a href="https://twitter.com/twylo/">@twylo</a>).
</p>

<p>
To include the recent posts, I included the first 25 lines of the automatically-generated
<code>sitemap.org</code> on my index page with:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-meta-line">#+INCLUDE: sitemap.org::*posts :lines "-25" :only-contents t</span>
</pre>
</div>
</div>
