content/posts/20211203-this-site.org
*** Sitemap Configuration
I specified the generation of the sitemap using ~org-publish-project-alist~ configuration variable:

#+begin_src emacs-lisp -n
;; org-site/build-site.el
(setq org-publish-project-alist
      (list
       (list "org-site:main"
             ;; other configuration settings
             :base-directly: "./content"
             :auto-sitemap t
             :sitemap-title nil
             :sitemap-format-entry 'my/org-publish-org-sitemap-format
             :sitemap-function 'my/org-publish-org-sitemap
             :sitemap-sort-files 'anti-chronologically
             :sitemap-filename "sitemap.org"
             :sitemap-style 'tree)))
#+end_src

*** Sitemap Entry Formatting
You'll notice two functions used to format and publish the sitemap entries. ~sitemap-format-entry~
takes three arguments (~entry~, ~style~, and ~project~). We only need to worry about the former. Each
~entry~ is a file or directory in the ~base-directory~ specified in the ~org-publish-project-alist~
above. My ~my/org-publish-org-sitemap-format~ defun closely follows the one [[https://thibaultmarin.github.io/blog/posts/2016-11-13-Personal_website_in_org.html#orgace8e3d][here]].

#+begin_src emacs-lisp -n
;; org-site/build-site.el
(defun my/org-publish-org-sitemap-format (entry style project)
  "Custom sitemap entry formatting: add date"
  (cond ((not (directory-name-p entry))
         (let ((preview (if (my/get-preview (concat "content/" entry))
                            (my/get-preview (concat "content/" entry))
                          "(No preview)")))
         (format "[[file:%s][(%s) %s]]\n%s"
                 entry
                 (format-time-string "%Y-%m-%d"
                                     (org-publish-find-date entry project))
                 (org-publish-find-title entry project)
                 preview)))
        ((eq style 'tree)
         (file-name-nondirectory (directory-file-name entry)))
        (t entry)))
#+end_src

This does the following:
1. Read in each entry's path
2. If the entry is /not/ a directory:
   - Check if the ~my/get-preview~ defun returns a value (more on ~my/get-preview~ later)
   - Assign the preview text to to the ~preview~ variable if ~my/get-preview~ is not null and assigns
     ~"(No preview)"~ to ~preview~ otherwise
   - Format the output as a link to the entry with ~(Date) Title~ as the description (using the
     ~org-publish-find-date~ and ~org-publish-find-title~ defuns to get the dates/titles of each
     entry)
   - include the ~preview~ (defined above) after a line break
3. If the entry /is/ a directory (e.g. if the first condition returns ~nil~) and if the ~sitemap-style~ is
   ~tree~, return the name of the last subdirectory (e.g. the entry ~/projects/org-site/content/posts~ would
   return ~posts~)
4. Otherwise, just return the entry unchanged.
*** Sitemap List Formatting
The entries formatted above are all added to a list (formatted in a tree style to represent the
directory structure). We simply convert this list into an org subtree and publish it to the
~sitemap.org~ file. The conversion is handled in the ~my/org-publish-org-sitemap~ file (again, adapted
from [[https://thibaultmarin.github.io/blog/posts/2016-11-13-Personal_website_in_org.html#orgace8e3d][here]]).

#+begin_src emacs-lisp -n
;; org-site/build-site.el
(defun my/org-publish-org-sitemap (title list)
  "Sitemap generation function."
  (concat "#+OPTIONS: toc:nil")
  (org-list-to-subtree list))
#+end_src

All this does is specify that we do not want a table of contents and that we want our formatted list
of entries (with previews) represented as an org subtree.
*** Previews
One part we haven't addressed yet is the generation of previews. There are different approaches out
there, but none of them did exactly what I wanted. I borrowed from posts by  [[https://loomcom.com/blog/0110_emacs_blogging_for_fun_and_profit.html][Seth Morabito]] and
especially [[https://ogbe.net/blog/blogging_with_org.html][Dennis Ogbe]]. The biggest change I wanted was making sure a default "No preview" would be
inserted if there wasn't a preview. I did this by ensuring the ~my/get-preview~ defun would return ~nil~
(instead of an error) without a preview, and that the entry formatting defun would return "No
preview" if ~my/get-preview~ was ~nil~.

#+begin_src emacs-lisp -n
;; org-site/build-site.el
(defun my/get-preview (file)
  "get preview text from a file

Uses the function here as a starting point:
https://ogbe.net/blog/blogging_with_org.html"
  (with-temp-buffer
    (insert-file-contents file)
    (goto-char (point-min))
    (when (re-search-forward "^#\\+BEGIN_PREVIEW$" nil 1)
      (goto-char (point-min))
      (let ((beg (+ 1 (re-search-forward "^#\\+BEGIN_PREVIEW$" nil 1)))
            (end (progn (re-search-forward "^#\\+END_PREVIEW$" nil 1)
                        (match-beginning 0))))
        (buffer-substring beg end)))))
#+end_src

This defun takes a file path as an argument and:
1. Inserts the contents of the file into a temporary buffer
2. Navigates to the beginning of the buffer and searches forward for the ~#+BEGIN_PREVIEW~ block
   pattern
   - If it fails to locate this pattern, the defun returns ~nil~
   - If it does locate this pattern, it:
     1. Returns to the beginning of the temporary buffer and repeats the search, recording the location of the
        block pattern, saving its location under the name ~beg~
     2. Searches forward again for the ~#+END_PREVIEW~ pattern, saving its location under the name
        ~end~
     3. Returns the text between ~beg~ and ~end~: the user-selected preview text.
