posts/20211203-this-site.html

<div id="outline-container-orgcf41199" class="outline-4">
<h4 id="orgcf41199">Sitemap Configuration</h4>
<div class="outline-text-4" id="text-orgcf41199">
<p>
I specified the generation of the sitemap using <code>org-publish-project-alist</code> configuration variable:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr"> 1: </span><span class="org-comment-delimiter">;; </span><span class="org-comment">org-site/build-site.el
<span class="linenr"> 2: </span></span>(<span class="org-keyword">setq</span> org-publish-project-alist
<span class="linenr"> 3: </span>      (list
<span class="linenr"> 4: </span>       (list <span class="org-string">"org-site:main"</span>
<span class="linenr"> 5: </span>             <span class="org-comment-delimiter">;; </span><span class="org-comment">other configuration settings
<span class="linenr"> 6: </span></span>             <span class="org-builtin">:base-directly:</span> <span class="org-string">"./content"</span>
<span class="linenr"> 7: </span>             <span class="org-builtin">:auto-sitemap</span> t
<span class="linenr"> 8: </span>             <span class="org-builtin">:sitemap-title</span> nil
<span class="linenr"> 9: </span>             <span class="org-builtin">:sitemap-format-entry</span> 'my/org-publish-org-sitemap-format
<span class="linenr">10: </span>             <span class="org-builtin">:sitemap-function</span> 'my/org-publish-org-sitemap
<span class="linenr">11: </span>             <span class="org-builtin">:sitemap-sort-files</span> 'anti-chronologically
<span class="linenr">12: </span>             <span class="org-builtin">:sitemap-filename</span> <span class="org-string">"sitemap.org"</span>
<span class="linenr">13: </span>             <span class="org-builtin">:sitemap-style</span> 'tree)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ac9d70" class="outline-4">
<h4 id="org7ac9d70">Sitemap Entry Formatting</h4>
<div class="outline-text-4" id="text-org7ac9d70">
<p>
You'll notice two functions used to format and publish the sitemap entries. <code>sitemap-format-entry</code>
takes three arguments (<code>entry</code>, <code>style</code>, and <code>project</code>). We only need to worry about the former. Each
<code>entry</code> is a file or directory in the <code>base-directory</code> specified in the <code>org-publish-project-alist</code>
above. My <code>my/org-publish-org-sitemap-format</code> defun closely follows the one <a href="https://thibaultmarin.github.io/blog/posts/2016-11-13-Personal_website_in_org.html#orgace8e3d">here</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr"> 1: </span><span class="org-comment-delimiter">;; </span><span class="org-comment">org-site/build-site.el
<span class="linenr"> 2: </span></span>(<span class="org-keyword">defun</span> <span class="org-function-name">my/org-publish-org-sitemap-format</span> (entry style project)
<span class="linenr"> 3: </span>  <span class="org-doc">"Custom sitemap entry formatting: add date"</span>
<span class="linenr"> 4: </span>  (<span class="org-keyword">cond</span> ((not (directory-name-p entry))
<span class="linenr"> 5: </span>         (<span class="org-keyword">let</span> ((preview (<span class="org-keyword">if</span> (my/get-preview (concat <span class="org-string">"content/"</span> entry))
<span class="linenr"> 6: </span>                            (my/get-preview (concat <span class="org-string">"content/"</span> entry))
<span class="linenr"> 7: </span>                          <span class="org-string">"(No preview)"</span>)))
<span class="linenr"> 8: </span>         (format <span class="org-string">"[[file:%s][(%s) %s]]\n%s"</span>
<span class="linenr"> 9: </span>                 entry
<span class="linenr">10: </span>                 (format-time-string <span class="org-string">"%Y-%m-%d"</span>
<span class="linenr">11: </span>                                     (org-publish-find-date entry project))
<span class="linenr">12: </span>                 (org-publish-find-title entry project)
<span class="linenr">13: </span>                 preview)))
<span class="linenr">14: </span>        ((eq style 'tree)
<span class="linenr">15: </span>         (file-name-nondirectory (directory-file-name entry)))
<span class="linenr">16: </span>        (t entry)))
</pre>
</div>

<p>
This does the following:
</p>
<ol class="org-ol">
<li>Read in each entry's path</li>
<li>If the entry is <i>not</i> a directory:
<ul class="org-ul">
<li>Check if the <code>my/get-preview</code> defun returns a value (more on <code>my/get-preview</code> later)</li>
<li>Assign the preview text to to the <code>preview</code> variable if <code>my/get-preview</code> is not null and assigns
<code>"(No preview)"</code> to <code>preview</code> otherwise</li>
<li>Format the output as a link to the entry with <code>(Date) Title</code> as the description (using the
<code>org-publish-find-date</code> and <code>org-publish-find-title</code> defuns to get the dates/titles of each
entry)</li>
<li>include the <code>preview</code> (defined above) after a line break</li>
</ul></li>
<li>If the entry <i>is</i> a directory (e.g. if the first condition returns <code>nil</code>) and if the <code>sitemap-style</code> is
<code>tree</code>, return the name of the last subdirectory (e.g. the entry <code>/projects/org-site/content/posts</code> would
return <code>posts</code>)</li>
<li>Otherwise, just return the entry unchanged.</li>
</ol>
</div>
</div>
<div id="outline-container-org5622541" class="outline-4">
<h4 id="org5622541">Sitemap List Formatting</h4>
<div class="outline-text-4" id="text-org5622541">
<p>
The entries formatted above are all added to a list (formatted in a tree style to represent the
directory structure). We simply convert this list into an org subtree and publish it to the
<code>sitemap.org</code> file. The conversion is handled in the <code>my/org-publish-org-sitemap</code> file (again, adapted
from <a href="https://thibaultmarin.github.io/blog/posts/2016-11-13-Personal_website_in_org.html#orgace8e3d">here</a>).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr">1: </span><span class="org-comment-delimiter">;; </span><span class="org-comment">org-site/build-site.el
<span class="linenr">2: </span></span>(<span class="org-keyword">defun</span> <span class="org-function-name">my/org-publish-org-sitemap</span> (title list)
<span class="linenr">3: </span>  <span class="org-doc">"Sitemap generation function."</span>
<span class="linenr">4: </span>  (concat <span class="org-string">"#+OPTIONS: toc:nil"</span>)
<span class="linenr">5: </span>  (org-list-to-subtree list))
</pre>
</div>

<p>
All this does is specify that we do not want a table of contents and that we want our formatted list
of entries (with previews) represented as an org subtree.
</p>
</div>
</div>
<div id="outline-container-org9293afa" class="outline-4">
<h4 id="org9293afa">Previews</h4>
<div class="outline-text-4" id="text-org9293afa">
<p>
One part we haven't addressed yet is the generation of previews. There are different approaches out
there, but none of them did exactly what I wanted. I borrowed from posts by  <a href="https://loomcom.com/blog/0110_emacs_blogging_for_fun_and_profit.html">Seth Morabito</a> and
especially <a href="https://ogbe.net/blog/blogging_with_org.html">Dennis Ogbe</a>. The biggest change I wanted was making sure a default "No preview" would be
inserted if there wasn't a preview. I did this by ensuring the <code>my/get-preview</code> defun would return <code>nil</code>
(instead of an error) without a preview, and that the entry formatting defun would return "No
preview" if <code>my/get-preview</code> was <code>nil</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr"> 1: </span><span class="org-comment-delimiter">;; </span><span class="org-comment">org-site/build-site.el
<span class="linenr"> 2: </span></span>(<span class="org-keyword">defun</span> <span class="org-function-name">my/get-preview</span> (file)
<span class="linenr"> 3: </span>  <span class="org-doc">"get preview text from a file
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>Uses the function here as a starting point:
<span class="linenr"> 6: </span>https://ogbe.net/blog/blogging_with_org.html"</span>
<span class="linenr"> 7: </span>  (<span class="org-keyword">with-temp-buffer</span>
<span class="linenr"> 8: </span>    (insert-file-contents file)
<span class="linenr"> 9: </span>    (goto-char (point-min))
<span class="linenr">10: </span>    (<span class="org-keyword">when</span> (re-search-forward <span class="org-string">"^#\\+BEGIN_PREVIEW$"</span> nil 1)
<span class="linenr">11: </span>      (goto-char (point-min))
<span class="linenr">12: </span>      (<span class="org-keyword">let</span> ((beg (+ 1 (re-search-forward <span class="org-string">"^#\\+BEGIN_PREVIEW$"</span> nil 1)))
<span class="linenr">13: </span>            (end (<span class="org-keyword">progn</span> (re-search-forward <span class="org-string">"^#\\+END_PREVIEW$"</span> nil 1)
<span class="linenr">14: </span>                        (match-beginning 0))))
<span class="linenr">15: </span>        (buffer-substring beg end)))))
</pre>
</div>

<p>
This defun takes a file path as an argument and:
</p>
<ol class="org-ol">
<li>Inserts the contents of the file into a temporary buffer</li>
<li>Navigates to the beginning of the buffer and searches forward for the <code>#+BEGIN_PREVIEW</code> block
pattern
<ul class="org-ul">
<li>If it fails to locate this pattern, the defun returns <code>nil</code></li>
<li>If it does locate this pattern, it:
<ol class="org-ol">
<li>Returns to the beginning of the temporary buffer and repeats the search, recording the location of the
block pattern, saving its location under the name <code>beg</code></li>
<li>Searches forward again for the <code>#+END_PREVIEW</code> pattern, saving its location under the name
<code>end</code></li>
<li>Returns the text between <code>beg</code> and <code>end</code>: the user-selected preview text.</li>
</ol></li>
</ul></li>
</ol>
</div>
</div>
</div>
</div>
