content/posts/20211203-this-site.org
* Putting It All Together
Check out the full source code for the site [[https://github.com/djliden/djliden.github.io][on GitHub]].
* What's Next?
This site now has everything I need to write more with minimal need to tweak the site configuration
every step of the way (which I found myself doing constantly when using Hugo). That said, there are
a few more things I want to do before moving this site to its permanent home under my personal
domain. These include:
** DONE [#A] Add navigation buttons to return to the home page/about page/archive page/etc. from any page. (incidentally, if you want to get back home, [[file:../index.org][here's the link]]).
*Update:* I've added this in a very simple way. I updated my ~org-publish-project-alist~ with:

#+begin_src emacs-lisp -n
;; org-site/build-site.el
(setq org-publish-project-alist
      (list
       (list "org-site:main"
             ;; ...
             :html-preamble (concat "<div class='topnav'>
                                     <a href='/index.html'>Home</a> / 
                                     <a href='/archive.html'>Blog</a> /
                                     <a href='/about.html'>About Me</a>
                                     </div>")
             ;; ...
             )))
#+end_src
** DONE [#B] Set up a good system for managing images (e.g. for data visualizations from R/Python)
I followed the guide [[https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html][here]] to set up the export of "static" files using the ~org-publish-attachment~
publication function. The new section of my config looks like this:

#+begin_src org
(setq org-publish-project-alist
      (list
       (list "org-site:main"
       ;; ...
             )
       ;; this part is new
       (list "org-site:static"
             :base-directory "./content/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
             :publishing-directory "./public"
             :recursive t
             :publishing-function 'org-publish-attachment
             )))
#+end_src

** TODO [#B] Set up and test LaTeX exporting for formulas etc.
** TODO [#C] Add a portfolio page showing some of my past work
** TODO [#C] Make a more visually interesting home page

