posts/20211203-this-site.html
<div id="outline-container-org0824a93" class="outline-2">
<h2 id="org0824a93">Putting It All Together</h2>
<div class="outline-text-2" id="text-org0824a93">
<p>
Check out the full source code for the site <a href="https://github.com/djliden/djliden.github.io">on GitHub</a>.
</p>
</div>
</div>
<div id="outline-container-org97436e0" class="outline-2">
<h2 id="org97436e0">What's Next?</h2>
<div class="outline-text-2" id="text-org97436e0">
<p>
This site now has everything I need to write more with minimal need to tweak the site configuration
every step of the way (which I found myself doing constantly when using Hugo). That said, there are
a few more things I want to do before moving this site to its permanent home under my personal
domain. These include:
</p>
</div>
<div id="outline-container-orge1ba74f" class="outline-3">
<h3 id="orge1ba74f"><span class="done DONE">DONE</span> Add navigation buttons to return to the home page/about page/archive page/etc. from any page. (incidentally, if you want to get back home, <a href="../index.html">here's the link</a>).</h3>
<div class="outline-text-3" id="text-orge1ba74f">
<p>
<b>Update:</b> I've added this in a very simple way. I updated my <code>org-publish-project-alist</code> with:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="linenr"> 1: </span><span class="org-comment-delimiter">;; </span><span class="org-comment">org-site/build-site.el
<span class="linenr"> 2: </span></span>(<span class="org-keyword">setq</span> org-publish-project-alist
<span class="linenr"> 3: </span>      (list
<span class="linenr"> 4: </span>       (list <span class="org-string">"org-site:main"</span>
<span class="linenr"> 5: </span>             <span class="org-comment-delimiter">;; </span><span class="org-comment">...
<span class="linenr"> 6: </span></span>             <span class="org-builtin">:html-preamble</span> (concat <span class="org-string">"&lt;div class='</span><span class="org-string"><span class="org-constant">topnav</span></span><span class="org-string">'&gt;
<span class="linenr"> 7: </span>                                     &lt;a href='</span><span class="org-string"><span class="org-constant">/index.html</span></span><span class="org-string">'&gt;Home&lt;/a&gt; / 
<span class="linenr"> 8: </span>                                     &lt;a href='</span><span class="org-string"><span class="org-constant">/archive.html</span></span><span class="org-string">'&gt;Blog&lt;/a&gt; /
<span class="linenr"> 9: </span>                                     &lt;a href='</span><span class="org-string"><span class="org-constant">/about.html</span></span><span class="org-string">'&gt;About Me&lt;/a&gt;
<span class="linenr">10: </span>                                     &lt;/div&gt;"</span>)
<span class="linenr">11: </span>             <span class="org-comment-delimiter">;; </span><span class="org-comment">...
<span class="linenr">12: </span></span>             )))
</pre>
</div>
</div>
</div>
<div id="outline-container-org6eb3667" class="outline-3">
<h3 id="org6eb3667"><span class="done DONE">DONE</span> Set up a good system for managing images (e.g. for data visualizations from R/Python)</h3>
<div class="outline-text-3" id="text-org6eb3667">
<p>
I followed the guide <a href="https://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">here</a> to set up the export of "static" files using the <code>org-publish-attachment</code>
publication function. The new section of my config looks like this:
</p>

<div class="org-src-container">
<pre class="src src-org">(setq org-publish-project-alist
      (list
       (list "org-site:main"
       ;; ...
             )
       ;; this part is new
       (list "org-site:static"
             :base-directory "./content/"
             :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf"
             :publishing-directory "./public"
             :recursive t
             :publishing-function 'org-publish-attachment
             )))
</pre>
</div>
</div>
</div>

<div id="outline-container-org94d574b" class="outline-3">
<h3 id="org94d574b"><span class="todo TODO">TODO</span> Set up and test LaTeX exporting for formulas etc.</h3>
</div>
<div id="outline-container-orgd878b26" class="outline-3">
<h3 id="orgd878b26"><span class="todo TODO">TODO</span> Add a portfolio page showing some of my past work</h3>
</div>
<div id="outline-container-org8335116" class="outline-3">
<h3 id="org8335116"><span class="todo TODO">TODO</span> Make a more visually interesting home page</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-12-03 Fri 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
